{
    "https://www.foxnews.com/us/suspect-3-pennsylvania-killings-makes-initial-court-appearance-related-new-jersey-charges": {
        "authors": [],
        "date_download": "2024-03-28 00:18:52",
        "date_modify": "None",
        "date_publish": "2024-03-27 15:49:38",
        "description": "A judge ruled on Wednesday that Andre Gordon Jr., the 26-year-old man charged in 3 fatal shootings in PA as well as weapons and carjacking counts in NJ, will stay behind bars as his case proceeds.",
        "filename": "https%3A%2F%2Fwww.foxnews.com%2Fus%2Fsuspect-3-pennsylvania-killings-makes-initial-court-appearance-related-new-jersey-charges.json",
        "image_url": "https://static.foxnews.com/foxnews.com/content/uploads/2024/03/Pennsylvania-Shootings.gif",
        "language": "en",
        "localpath": null,
        "maintext": "TRENTON, N.J. (AP) — A man charged in the fatal shooting of three family members in Pennsylvania and related carjacking and weapons counts in New Jersey will remain behind bars while his case proceeds, a judge ruled Wednesday.\nAndre Gordon Jr., 26, appeared via video from the Mercer County jail for his initial court appearance on the New Jersey charges. Gordon did not enter a plea, and he waived his right to contest pretrial detention.\nPENNSYLVANIA AMISH MURDER: NO MOTIVE IN PREGNANT WOMAN'S SLAYING, BUT WITNESSES SAW SUSPECT'S CAR AT SCENE\nSuperior Court Judge Robert W. Bingham II ruled that Gordon will remain in custody until his trial, and scheduled an extradition hearing for April 3. Gordon's public defender, Nicole Carlo, said he will consent to extradition to Pennsylvania to face charges in Bucks County.\nA message was left with Carlo's office seeking comment on Gordon's behalf.\nAuthorities have said Gordon carjacked a vehicle in Trenton, New Jersey, on March 16 before driving to Levittown in Falls Township, Pennsylvania, where he killed his stepmother and sister. He then drove to a second home in Levittown and killed the mother of his two children, authorities said. He is also accused of injuring his children’s grandmother by bludgeoning her with a rifle.\nAuthorities say Gordon shot and killed his 52-year-old stepmother, Karen Gordon; his 13-year-old sister, Kera Gordon; and 25-year-old Taylor Daniel, the mother of his two children. Authorities have said Gordon's children were present when he shot their mother.\nGordon then carjacked a second vehicle in Morrisville and returned to Trenton, authorities said. Police surrounded a home for hours in the belief that he was there, but Gordon apparently slipped out before a cordon went up. He was arrested, unarmed, when he was spotted walking down a street a few blocks away.\nCLICK HERE TO GET THE FOX NEWS APP\nThe mayhem forced the cancellation of a St. Patrick’s Day parade in Pennsylvania's Bucks County and the closure of a Sesame Street-themed amusement park and a number of other businesses. Authorities issued a shelter-in-place order for several hours.\nOfficials have not released a possible motive for the attacks.",
        "source_domain": "www.foxnews.com",
        "text": null,
        "title": "Suspect in 3 Pennsylvania killings makes initial court appearance on related New Jersey charges",
        "title_page": null,
        "title_rss": null,
        "url": "https://www.foxnews.com/us/suspect-3-pennsylvania-killings-makes-initial-court-appearance-related-new-jersey-charges"
    },
    "https://www.foxnews.com/us/alabama-convict-robbed-killed-elderly-couple-gets-execution-date": {
        "authors": [],
        "date_download": "2024-03-28 00:18:52",
        "date_modify": "None",
        "date_publish": "2024-03-27 15:02:12",
        "description": "Jamie Mills, an Alabama inmate convicted of capital murder in the fatal beatings of Floyd and Vera Hill, is set to die by lethal injection on May 30.",
        "filename": "https%3A%2F%2Fwww.foxnews.com%2Fus%2Falabama-convict-robbed-killed-elderly-couple-gets-execution-date.json",
        "image_url": "https://static.foxnews.com/foxnews.com/content/uploads/2024/03/jamie_mills.jpg",
        "language": "en",
        "localpath": null,
        "maintext": "Alabama has set a May 30 execution date for a man convicted in the 2004 slaying of a couple during a robbery.\nAlabama Gov. Kay Ivey set the date for the execution by lethal injection of Jamie Mills, 50. The Alabama Supreme Court last week authorized the governor to set an execution date.\nMISSOURI SETS EXECUTION DATE FOR SECOND DEATH ROW INMATE THIS YEAR\nMills was convicted of capital murder for the 2004 slaying of Floyd and Vera Hill in Guin, a city of about 2,000 people in Marion County. Prosecutors said Mills and his wife went to the couple’s home where he beat the couple and stole $140 and medications.\nFloyd Hill, 87, died from blunt and sharp-force wounds to his head and neck, and Vera Mills, 72, died from complications of head trauma 12 weeks after the crime, the attorney general’s office wrote in a court filing.\nAttorneys for Mills had asked the Alabama Supreme Court to deny the execution date request while they pursue a pending claim of prosecutorial misconduct in the case.\nMills’ attorneys wrote in a March petition to a Marion County judge that prosecutors concealed that they had a plea deal with Mills’ wife that spared her from a possible death sentence. She was the key prosecution witness against Mills at his trial. The attorney general’s office disputed that there was a pretrial agreement.\nCLICK HERE TO GET THE FOX NEWS APP\nAlabama, which carried out the nation’s first execution by nitrogen gas earlier this year, says it plans to put Mills to death by lethal injection.",
        "source_domain": "www.foxnews.com",
        "text": null,
        "title": "Alabama convict who robbed, killed elderly couple gets execution date",
        "title_page": null,
        "title_rss": null,
        "url": "https://www.foxnews.com/us/alabama-convict-robbed-killed-elderly-couple-gets-execution-date"
    },
    "https://www.foxnews.com/politics/desantis-eliminates-squatters-rightsflorida-gives-power-cops-remove-offenders": {
        "authors": [
            "Emma Colton"
        ],
        "date_download": "2024-03-28 00:18:53",
        "date_modify": "None",
        "date_publish": "2024-03-27 14:47:31",
        "description": "Republican Florida Gov. Ron DeSantis on Wednesday signed a bill into law that increases penalties against squatters and eliminates their \"rights\" to fraudulently live on a property.",
        "filename": "https%3A%2F%2Fwww.foxnews.com%2Fpolitics%2Fdesantis-eliminates-squatters-rightsflorida-gives-power-cops-remove-offenders.json",
        "image_url": "https://static.foxnews.com/foxnews.com/content/uploads/2024/03/desantissquatters.png",
        "language": "en",
        "localpath": null,
        "maintext": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\nRepublican Florida Gov. Ron DeSantis on Wednesday signed legislation into law that eliminates squatters’ rights in the Sunshine State and increases penalties against offenders.\n\"You are not going to be able to commandeer somebody's private property and expect to get away with it. We are in the state of Florida ending the squatter scam once and for all,\" DeSantis said during a press conference on the signing in Orlando.\nThe law will take effect July 1. DeSantis noted ahead of the signing that he believes Florida is the first state in the nation to take squatting issues head-on.\nLawmakers in the state overwhelmingly voted in support of the bill earlier this month, sending it to DeSantis’ office. The law outlines that squatters will face criminal charges for illegally moving into a home and allows property owners to file an affidavit showing they legally own a property.\nFLORIDA HOMEOWNER SHARES SQUATTER EVICTION SUCCESS STORY: 'WE WENT THE RIGHT WAY'\nBefore the bill’s passage, squatters in Florida, as well in states from coast to coast, were considered tenants and required legal property owners to launch lengthy court battles to legally remove inhabitants from a home.\n\"This is an important bill if you see the stories that happen,\" Republican state Sen. Keith Perry, who sponsored the bill, said as it made its way through the legislature, according to Wear TV. \"It is egregious what people are getting away with under legislation.\"\nSQUATTERS WOULD GET BOOTED IMMEDIATELY UNDER BILL LAWMAKERS IN THIS STATE UNANIMOUSLY PASSED\nUnder the new law, property owners can now call on the sheriff’s office to immediately remove squatters from their homes if the suspects are unable to produce documents authorizing their residency by the property owner.\nThe law \"will give the homeowner the ability to quickly and legally remove a squatter from a property and which will increase criminal penalties for squatting. Now, we have not had the same type of issues here, as you've seen in California or New York. Nevertheless, our laws were really geared towards this not necessarily being a fad,\" DeSantis said while standing in front of a podium with a sign reading, \"Ending the Squatters Scam.\"\nDeSantis specifically called out California and New York for rampant squatting issues, saying the blue states protect squatters, while Florida will crack down and consider them criminals.\n\"They're siding with the squatters,\" he said of the Democrat-led states. \"In fact, we have seen squatters move in and claim residence. This forces a massive, long, drawn-out judicial review before they can even be removed from the property. These are people that never had a right to be in the property to begin with. Earlier this month in New York, a woman returned to a property she inherited to find squatters living there. She changed the locks to get them out, and the state of New York arrested her instead of the squatters.\"\nThe law establishes harsher penalties against those who participate in squatting crimes, including leveling a second-degree felony charge against squatters who damage a home, a first-degree felony charge against those who fraudulently sell or lease a property, and a misdemeanor charge against those who purposefully present a fraudulent lease.\nFLORIDA BILL AIMS TO CLOSE SQUATTING LOOPHOLE AFTER HOMEOWNER TERRORIZED FOR 34 DAYS, $40,000 IN DAMAGES\nSheriff Dennis M. Lemma celebrated the passage of the bill and the governor's signature, while saying the word \"squatter\" is too favorable and they should instead be referred to as \"criminals and con artists.\"\n\"I want to thank our legislative body, both our delegates here in central Florida and abroad, because this received unanimous support, and it's been long too often where we've seen homeowners that have spent their entire life working and earning. Some have inherited homes of parents and to knock on the door and be met with squatters,\" Lemma said at the press conference.\n\"Squatters actually is a very, very kind term. These are criminals and con artists that need to be held accountable to the fullest extent of the law,\" he continued.\nFlorida, similar to other states across the nation, has seen repeated incidents of squatters fraudulently moving into a home or property, including a squatter in September who moved into a multimillion-dollar home in Bonita Springs and was found wearing the homeowner's clothing. Another homeowner in June, who was on vacation abroad before returning to his Ocala house, was forced to confront a squatter who trashed his property in his absence.\nWhile residents in a neighborhood in Winter Park sounded off in September that squatters had turned the area into a \"nightmare\" because the police department was \"handcuffed\" from arresting the suspects as it was considered a civil matter.\nSQUATTER PIRATES IN FLORIDA SETTING UP HOMES ON ABANDONED BOATS\nThe issue has even affected the Sunshine State’s massive boating community, with squatters taking over derelict boats off the coast of Martin County in a phenomenon that began last year, the sheriff’s office previously told Fox News Digital. While other law enforcement agencies near Port Orange last June dismantled structures on an island known for its drug use that was overtaken by squatters.\nFlash Shelton, known as the \"Squatter Hunter\" who removes squatters from people's homes, also spoke during the press conference, explaining how he personally dealt with confronting and removing squatters from his mother's home last year.\nCLICK TO GET THE FOX NEWS APP\n\"I know what it feels like to feel the helpless, hopeless feeling when dealing with squatters and the law saying it's a civil matter. Fearing that long-drawn-out and costly process, I decided to lift my head up, stand up and fight. I broke the law down to its knees, and figured out that if they could take a house, I could take a house,\" Shelton recounted of his first run-in with squatters at his mother's home.\n\"I got my squatters out in less than a day using the same system and their rights against them,\" he said.",
        "source_domain": "www.foxnews.com",
        "text": null,
        "title": "DeSantis eliminates 'squatters' rights' in Florida, gives power to cops to remove offenders",
        "title_page": null,
        "title_rss": null,
        "url": "https://www.foxnews.com/politics/desantis-eliminates-squatters-rightsflorida-gives-power-cops-remove-offenders"
    },
    "https://www.foxnews.com/us/perp-walk-new-yorkers-shout-suspect-fatal-shooting-nypd-police-officer-now-faces-charges": {
        "authors": [
            "Danielle Wallace"
        ],
        "date_download": "2024-03-28 00:18:54",
        "date_modify": "None",
        "date_publish": "2024-03-27 13:08:22",
        "description": "Lindy Jones, one of two suspects arrested after NYPD Officer Jonathan Diller's fatal shooting during a traffic stop in Queens, was charged Wednesday.",
        "filename": "https%3A%2F%2Fwww.foxnews.com%2Fus%2Fperp-walk-new-yorkers-shout-suspect-fatal-shooting-nypd-police-officer-now-faces-charges.json",
        "image_url": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/694940094001/b34084f1-155c-4da4-ba34-ac25b6e08e98/a1cca22d-7cb7-4e60-9c45-cd58f4a3b78b/1280x720/match/image.jpg",
        "language": "en",
        "localpath": null,
        "maintext": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\nNew Yorkers were heard shouting at one of the two men arrested in the fatal shooting of NYPD Officer Jonathan Diller during his perp walk on Wednesday.\nLindy Jones, the 41-year-old driver of the vehicle stopped by Diller and his partner for illegally parking at a bus stop, faces criminal possession of a weapon and defacing a firearm charges, the department said Wednesday. No charges have been announced yet against the suspected gunman and Diller's alleged killer, Guy Rivera.\nJones' perp walk was brief, and he did not respond to any questions while police placed him in the back of a department vehicle.\nOnlookers shouted things, such as \"what do you have to say to his family, Lindy?\" as well as \"there is a baby that is gonna grow up without a father, Lindy\" and \"Shame on you young man.\"\nNYPD OFFICER JONATHAN DILLER'S NEIGHBOR, A RETIRED 9/11 RESPONDER, SAYS HOCHUL, DAS HAVE 'BLOOD ON THEIR HANDS\nThe Queens District Attorney's Office told Fox News that Jones' arraignment will take place on Wednesday.\nRivera, 34, allegedly opened fire during a traffic stop conducted by Diller and his partner in Far Rockaway, Queens, at about 5:45 p.m. on Monday.\nRivera, who was in the passenger seat, allegedly fired first at police, fatally striking Diller in the torso below his protective vest. Rivera was struck by return fire and remains hospitalized at Jamaica Hospital.\nImage 1 of 4 next\nImage 2 of 4 prev next\nImage 3 of 4 prev next\nImage 4 of 4 prev\nAfter prosecutors obtained a search warrant for the SUV, authorities said a second firearm was found inside the vehicle, WABC reported.\nAs New York City mourns the 31-year-old Diller, who lived on Long Island with his wife and nearly 1-year-old son, one of his neighbors in Massapequa Park, blasted Gov. Kathy Hochul's support of \"inexplicable bail reform laws,\" as well as the \"revolving door of justice\" in the Empire State as having contributed to Diller's tragic passing.\nNew York City Mayor Eric Adams said that at least one of the suspects had over 20 prior arrests, demanding Albany state lawmakers address what he deemed a \"recidivist problem\" driving violent crime.\nSUSPECTS IN SHOOTING DEATH OF NYPD OFFICER JONATHAN DILLER IDENTIFIED, HAVE LENGTHY RECORDS\nAccording to reports, Rivera had been previously arrested by the NYPD 21 times, including nine times for felony offenses. He was released from prison in September 2021 after serving nearly five years for criminal sale of a controlled substance, WABC reported, citing court records. He previously served three years in state prison in connection to a 2011 assault and was released in October 2014.\nMeanwhile, Jones had previously been arrested by the NYPD 14 times, most recently for second-degree criminal possession of a weapon for having a loaded firearm in Far Rockaway on April 17, 2023. He was out on $75,000 bail at the time of Diller’s slaying. Jones previously served 10 years in prison stemming from 2003 attempted murder and robbery charges and was released in November 2013.\nAuthorities suspect Jones and Rivera were casing a T-Mobile store on Mott Avenue on Monday when Diller and his partner asked the two suspects to move their vehicle from a bus stop. The men allegedly refused to roll down their windows. When Diller ordered the passenger, Rivera, to show his hands, Rivera allegedly opened fire, striking Diller below his vest. Diller's partner then fired at Rivera, striking him in the back, police said.\nDiller's brother-in-law, Jonathan McAuley, who is also a police officer, posted a tribute on Facebook.\n\"The Lord called my brother-in-law, Jonathan Diller, home. Surrounded by family and the the men and women in blue, he was walked out [honorably], to many tears and salutes from Jamaica Hospital. What started out as an everyday car stop, instantly became a moment where so many lives would be turned upside down. Jon leaves behind a wife and a one-year-old son who will now grow up without his father,\" McAuley wrote.\nCLICK HERE TO GET THE FOX NEWS APP\n\"To those of you out there in the streets, it can be so easy to become wrapped into the moment. To think horrible events like this cant happen to you. To become focused on making that next arrest or racing to the action. Remember those who love you at those moments,\" the post added. \"Jon, there are no words to describe how [devastated] we are that you are gone. You were a good man and a great father whose shoes can never be filled. I swear to you that I will look after your son as if he were my own. For the rest of my life.\"\nFox News' Kitty Le Claire contributed to this report.",
        "source_domain": "www.foxnews.com",
        "text": null,
        "title": "Perp walk: New Yorkers shout at suspect in fatal shooting of NYPD police officer, who now faces charges",
        "title_page": null,
        "title_rss": null,
        "url": "https://www.foxnews.com/us/perp-walk-new-yorkers-shout-suspect-fatal-shooting-nypd-police-officer-now-faces-charges"
    },
    "https://www.foxnews.com/us/utah-childrens-book-author-sent-damning-text-lover-before-hubby-poison-plot-docs": {
        "authors": [
            "Audrey Conklin",
            "Greg Skordas",
            "Eric Richins To Witness"
        ],
        "date_download": "2024-03-28 00:18:54",
        "date_modify": "None",
        "date_publish": "2024-03-27 13:01:03",
        "description": "Utah woman Kouri RIchins, a children's book author accused of poisoning her husband Eric Richins with fentanyl in 2022, is now facing a new attempted murder charge.",
        "filename": "https%3A%2F%2Fwww.foxnews.com%2Fus%2Futah-childrens-book-author-sent-damning-text-lover-before-hubby-poison-plot-docs.json",
        "image_url": "https://static.foxnews.com/foxnews.com/content/uploads/2023/10/Richins.jpg",
        "language": "en",
        "localpath": null,
        "maintext": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\nKouri Richins, a Utah mom of three and children's book author accused of murdering her husband in 2022, allegedly texted her lover on the night of her husband's death.\nAuthorities in 2023 charged Richins, now 35, with aggravated murder and drug possession, alleging she poisoned her husband, Eric Richins, on March 3, 2022, with illicit fentanyl as a means to collect millions in life insurance funds. Now, she is facing a new attempted murder charge for allegedly poisoning her husband on Feb. 14, 2022, as well.\n\"It seems that the [Summit] County Attorney's Office and the Summit County Sheriff's Office are continuing their investigation, and … they've been able to discover more and more about what happened prior to the time Eric was ultimately killed,\" Greg Skordas, an attorney representing Eric's family, told Fox News Digital. \"I think it's entirely appropriate that they've continued that investigation … and that it's brought more charges.\"\nProsecutors also allege in new charging documents that Kouri texted her \"paramour\" on the night of Eric's murder.\nMOM OF UTAH AUTHOR ACCUSED OF POISONING HUSBAND POSSIBLY ‘INVOLVED IN PLANNING’ HIS DEATH, POLICE SAY\n\"At 7:22 p.m. on March 3, 2022, the night of Eric Richins’ death, the Defendant’s Paramour text messaged the Defendant a photograph of two people kissing that was captioned, ‘love you,’\" the documents filed on Monday state. \"At 8:36 p.m., the Defendant responded, ‘… love you [kiss emoji].’\"\nSkordas previously told Fox News Digital after Kouri was initially charged in Eric's murder that he believed she was having an affair.\nUTAH MAN ALLEGEDLY MURDERED BY AUTHOR WIFE TOOK ‘HIGHLY UNUSUAL' STEPS TO BOOT HER OUT OF WILL\n\"We always knew Kouri was having an extramarital affair,\" he said Wednesday. \"It's just that the district attorney's office hadn't … equated that to having relevance to the charges. As they dug deeper, it really, I think, establishes another motive besides financial for her to want Eric out of her life.\"\n\"[I]t really, I think, establishes another motive besides financial for her to want Eric out of her life.\" — Greg Skordas\nSkye Lazaro, Kouri's defense attorney, maintained her client's innocence in light of the new charge.\n\"We have reviewed the State's Amended Information filed today. There is nothing in the document that affects Kouri's approach to defending whatever charges the State levies against her,\" Lazaro said in a statement to Fox News Digital. \"She continues to maintain her innocence.\"\nProsecutors initially alleged that Kouri killed Eric in an effort to collect millions in life insurance funds and flip a $2 million Wasatch County mansion that was under construction at the time of Eric's death — an investment that his family said he did not approve of.\nUTAH MOM KOURI RICHINS GOOGLED ‘LUXURY PRISONS FOR THE RICH’ AFTER ALLEGEDLY KILLING HER HUSBAND: DOCS\nThe same night Eric died, authorities say he, Kouri and her mother, Lisa Darden, were celebrating Kouri's recent closure of the mansion in question. The then-33-year-old, who owned a real estate company, wanted to finish building the mansion and sell it for a profit, according to search warrants.\nKouri allegedly poured her husband a Moscow mule laced with fentanyl while celebrating that evening. A medical examiner determined that Eric had more than five times the lethal amount of illicit fentanyl in his system when he died. The examiner also found \"16,000 ng/ml of Quetiapine,\" described as an \"atypical antipsychotic medication that is \"widely used as a sleep aid,\" in Eric Richins’ gastric fluid, new charging documents state.\nThe next day, Kouri allegedly closed a deal on the mansion \"alone\" after her husband was pronounced dead.\nPrevious court documents have included information about the alleged Valentine's Day poisoning, but Kouri had not been formally charged in that incident until Monday.\nUTAH AUTHOR ACCUSED OF MURDERING HUSBAND ALLEGEDLY CAUGHT TRYING TO STEAL HIS LIFE INSURANCE BENEFITS\nEric's family told authorities after his murder that he had been in fear for his life when Kouri allegedly tried to poison him several years ago in Greece and again on Valentine's Day in 2022. Eric told two close friends that on Valentine's Day, he ate a sandwich Kouri left for him with a note and immediately broke out in hives. He took his son's Epipen and ingested Benadryl before falling asleep for hours.\n\"I think my wife tried to poison me.\" — Eric Richins to Witness 2\nKouri told other witnesses that she had purchased the sandwich from a diner and maintains that she did not poison it.\nEric had also taken complex steps to boot Kouri from his will as early as 2020, according to his estate-planning lawyer.\n\"His first goal was to protect him in the short-term from fairly recently discovered and ongoing abuse and misuse of his finances by his wife Kouri Richins. … His second was to protect the three young sons he and Kouri had together in the long-term by ensuring that Kouri would never be in a position to manage his property after his death,\" Eric's estate-planning attorney, Kristal Bowman-Carter, wrote in previously filed court documents.\nEarlier this month, a recently unsealed search warrant implicated Kouri's mother, Lisa Darden, in Eric's death.\nIn May 2023, a Summit County Sheriff's Office detective submitted a search warrant affidavit expressing his belief that Darden may have been \"involved in planning and orchestrating Eric's death,\" based on her own connection to a suspicious death in 2006.\nWhile investigating Kouri, detectives learned that in 2006, Darden was living with a female romantic partner who died unexpectedly of an oxycodone overdose.\nGO HERE FOR MORE TRUE CRIME FROM FOX NEWS DIGITAL\n\"Further investigation showed that Lisa Darden had been named as the beneficiary of her partner’s estate a short time before her death,\" a detective wrote in the search warrant. \"The female did have current prescriptions for oxycodone and reportedly struggled with abusing her meds. She, however, was not in a state of recovery from addiction at the time of her death. Based on my training and experience, this would likely rule out the possibility of an accidental overdose.\"\nLazaro denied the detective's suggestion, saying Darden's partner was a victim of the national opioid crisis, which killed 112,000 Americans between May 2022 and May 2023, according to the Centers for Disease Control and Prevention.\nUTAH CHILDREN'S BOOK AUTHOR HAD ‘PERFECT’ MARRIAGE WITH HUSBAND BEFORE ALLEGED MURDER: FRIEND\nDarden's partner, Lazaro said, \"was one of the millions that suffered from, and ultimately succumbed to, opioid addiction,\" which \"is hardly ‘suspicious.’\"\n\"It is tragic, and unfortunately, quite common,\" the attorney said.\nIn May 2022, about two months after Eric's death, Darden allegedly told Kouri that a witness — who told police Kouri contacted him for fentanyl in January 2022 — was \"running his mouth,\" the new charging documents state.\nSkordas said \"getting information from\" Darden's phone \"has directed law enforcement toward her … and her involvement in this.\"\nCLICK TO GET THE FOX NEWS APP\n\"It's just a natural product of some of the search warrants that follow the investigation being done here to bring Lisa Darden into the equation,\" the attorney said.\nSkordas added that it is \"not a concern\" to his team that \"new charges are being brought and new evidence is being investigated\" in the case ahead of a preliminary hearing for Kouri.",
        "source_domain": "www.foxnews.com",
        "text": null,
        "title": "Utah children’s book author sent damning text to lover before hubby poison plot: docs",
        "title_page": null,
        "title_rss": null,
        "url": "https://www.foxnews.com/us/utah-childrens-book-author-sent-damning-text-lover-before-hubby-poison-plot-docs"
    },
    "https://www.foxnews.com/us/californias-facial-hair-ban-prison-guards-amounts-religious-discrimination-justice-department-says": {
        "authors": [],
        "date_download": "2024-03-28 00:18:54",
        "date_modify": "None",
        "date_publish": "2024-03-27 12:57:10",
        "description": "The DOJ filed a civil rights complaint on Monday asking that California halt the prohibition of facial hair for prison guards, as it amount to religious discrimination.",
        "filename": "https%3A%2F%2Fwww.foxnews.com%2Fus%2Fcalifornias-facial-hair-ban-prison-guards-amounts-religious-discrimination-justice-department-says.json",
        "image_url": "https://static.foxnews.com/foxnews.com/content/uploads/2024/03/fed-correctional-institution-in-california.jpg",
        "language": "en",
        "localpath": null,
        "maintext": "The federal government is asking a court to halt California's enforcement of a rule requiring prison guards to be clean-shaven, saying it amounts to religious discrimination for Sikhs, Muslims and others who wear beards as an expression of their faith.\nThe civil rights complaint filed Monday by the U.S. Justice Department says the California Department of Corrections and Rehabilitation's prohibition on facial hair denies on-the-job accommodations for officers of various religions.\nBIOLOGICAL MEN ARE NOW WELCOME IN CALIFORNIA WOMEN'S PRISONS: 'AN AGENDA FOR FEMALE ERASURE'\nIt seeks a temporary court order \"allowing these officers to wear beards while CDCR fully assesses options for providing them with religious accommodations while complying with California safety regulations,\" the Justice Department said in a statement.\n\"Sikhs, Muslims and employees of other minority faiths should not be forced to choose between the practice of their faith and their jobs,\" Assistant Attorney General Kristen Clarke said in the statement. \"Religious freedom and religious accommodation are bedrock principles of our democracy. We are taking action to ensure that the rights of employees of minority faiths are respected and accommodated in the workplace.\"\nThe corrections department maintains its no-beard rule stems from the need for certain employees, including guards, to wear tight-fitting respirators, with state law requiring that facial hair not interfere with the use of such masks that were worn during the coronavirus pandemic, according to court papers cited by the Sacramento Bee.\nIn an emailed statement to The Associated Press, the state agency defended its policy.\n\"CDCR respects all sincerely held religious beliefs and strives to reasonably accommodate individuals seeking religious reasonable accommodations to the extent doing so does not conflict with other legal obligations,\" spokesperson Mary Xjimenez said Tuesday.\n\"Tight-fitting respirator masks are legally required under workplace safety laws for certain functions in state prison operations, as well as for the safety and protection of the incarcerated population and other staff. CDCR is fully compliant with the law, and we are confident the court will agree,\" Xjimenez said.\nCLICK HERE TO GET THE FOX NEWS APP\nThe Justice Department’s complaint, filed in U.S. District Court in Sacramento, also seeks a court order prohibiting retaliation or discipline against officers requesting to grow or keep beards as the case progresses.",
        "source_domain": "www.foxnews.com",
        "text": null,
        "title": "California's facial hair ban for prison guards amounts to religious discrimination, Justice Department says",
        "title_page": null,
        "title_rss": null,
        "url": "https://www.foxnews.com/us/californias-facial-hair-ban-prison-guards-amounts-religious-discrimination-justice-department-says"
    },
    "https://www.foxnews.com/us/arizona-strip-clubs-swindled-1-million-customers-elaborate-scheme-lawsuit": {
        "authors": [
            "Christina Coulter"
        ],
        "date_download": "2024-03-28 00:18:55",
        "date_modify": "None",
        "date_publish": "2024-03-27 12:26:18",
        "description": "Nearly 20 people claim they were fleeced out of more than $1 million at a chain of Arizona strip clubs in the Scottsdale area after they were drugged.",
        "filename": "https%3A%2F%2Fwww.foxnews.com%2Fus%2Farizona-strip-clubs-swindled-1-million-customers-elaborate-scheme-lawsuit.json",
        "image_url": "https://static.foxnews.com/foxnews.com/content/uploads/2024/03/cabaret.jpg",
        "language": "en",
        "localpath": null,
        "maintext": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\nNearly 20 people are suing a chain of Arizona strip clubs after they were allegedly drugged and scammed out of a collective $1.1 million in VIP rooms.\nSkin Cabaret, Bones Cabaret and Dream Palace – three clubs along the same two-mile stretch from Scottsdale to Tempe owned by Todd Borowsky – are named in the latest filing from January, obtained by Fox 10 Phoenix. The club owner, who operated under Wisnowski, Inc., is accused of racketeering, conspiracy and several other allegations.\nOne alleged victim, an Air Force member stationed in Arizona who says his credit cards were charged just over $72,000, told the local outlet that the fallout of the incident has been \"life and career-altering.\" The man, identified by Fox 10 as \"Joe,\" claims that he was separated from his friends when he went to the bathroom before the night went awry.\n\"I remember walking through what I thought was a cloud of perfume or makeup or something like dusty from one of the kind of cracks of light that was coming through,\" the plaintiff told the outlet. \"That’s when I ended up in the VIP room and started to get these symptoms not alcohol-related, something else that made me acquiesce and go along to what they seemed to be pushing.\"\nSQUATTERS OPENING STRIP CLUBS AND DRUG-FUELED PARTY HOUSES SHOWS FREELOADER TACTIC EVOLUTION: SQUATTER HUNTER\nA financial crimes detectives with the Scottsdale Police Department wrote in court documents reviewed by Fox News Digital that Joe's story of what happened next matched those of patrons visiting from several different states; memory loss, signing and thumbprinting paperwork, having photos taken of them and leaving with exorbitant credit card charges.\nJoe told Fox 10 that he never took a drug test, but he \"felt like I kind of didn’t have control of the situation and that was really the first instance that I knew.\"\nAnother plaintiff, referred to as \"Bobby\" by Fox 10, told the outlet that he was \"just confused\" when he found himself in one of the club's VIP rooms.\n\"Just felt lost, spaced out. Like I said, I had no clue where I was at that point.\"\nAOC ROASTED BY LEGAL EXPERTS FOR CLAIMING 'RICO IS NOT A CRIME': 'EMBARRASSED HERSELF'\nBobby said that he paid for drinks and a private dance, but after that, he has no recollection of authorizing further charges to his cards at Skin Cabaret. In total, he spent $181,000 at the club in eight transactions, according to court documents.\n\"Didn't think that these were actually legitimate transactions at that point,\" he told the outlet. \"It just seemed unconscionable that this would even happen. Especially the charges, the single transaction amounts, that were processed.\"\nLike Joe, Bobby said that the impact was \"emotionally pretty difficult to bear.\"\n\"Couldn’t have an appetite to eat for days after this had occurred … strain on not only myself, a family, wife, had to get my parents involved. We had little children as well,\" Bobby said.\nARIZONA RANCHER FACES LONG-AWAITED MURDER TRIAL IN BORDER SHOOTING OF MEXICAN MAN AFTER REJECTING PLEA DEAL\nPolice reports included in the suit show that customers sign a contract, provide a credit card and ID, give a thumbprint and take a photo after negotiating a VIP room price with a hostess at the three clubs. However, the plaintiffs in the lawsuit do not or barely remember signing these contracts at all, according to court documents.\nRod Galarza, an attorney representing the alleged victims, almost all of them from out of state, told Fox 10 that they \"all tell the same story yet none of them have met.\"\n\"They vaguely recall someone yelling at them to ‘quit messing around and to hold the pen properly’ to sign a document on a clipboard, or alternatively being yelled at by a bouncer or hostess to ‘sit up straight and smile, we’re trying to take your picture, you’re not smiling,'\" Galarza said.\nOne plaintiff even claims that club reps approved his credit card transactions by holding his phone up to his face to unlock his phone using the face ID function.\nJoe said it was \"like watching a movie through [his] own eyes.\"\n\"It was kind of almost an out-of-body experience because, in my mind, I’m screaming to myself that this is wrong, to leave, to fight my way out,\" he told Fox 10. \"But they have the bouncer at the door, the disorienting hallways, like I don’t think I’m going to make it out.\"\nThe Scottsdale Police Department and Maricopa County Sheriff's Office told Fox 10 that they are aware of the allegations against Skin Cabaret, Bones Cabaret and Dream Palace and are working with the Arizona Attorney General's Office on cases against the strip joints. Fox News Digital could not reach the state's attorney general for comment at press time.\nIn a statement to Fox 10, an attorney representing club owner Borowsky said that \"the cases are baseless.\"\nCLICK HERE TO GET THE FOX NEWS APP\n\"It's like going into a casino and asking for your money back after you choose to be there. First, they were not drugged,\" attorney Dennis Wilenchik told the outlet. \"Second, the dancers were independent contractors. Third, these guys received services they expressly contracted for and received and documentation and photos were taken, and fourth, their credit card companies also investigated and approved the transactions.\"",
        "source_domain": "www.foxnews.com",
        "text": null,
        "title": "Arizona strip clubs swindled $1M from customers in elaborate scheme: lawsuit",
        "title_page": null,
        "title_rss": null,
        "url": "https://www.foxnews.com/us/arizona-strip-clubs-swindled-1-million-customers-elaborate-scheme-lawsuit"
    },
    "https://www.foxnews.com/lifestyle/nyc-women-punched-face-streets-tiktok-alarm-frightening-assaults": {
        "authors": [
            "Angelica Stabile"
        ],
        "date_download": "2024-03-28 00:18:56",
        "date_modify": "None",
        "date_publish": "2024-03-27 12:13:04",
        "description": "Multiple young women have claimed on TikTok that they've been punched in the face on the streets of New York City within the last few weeks. The NYPD shares that it is investigating.",
        "filename": "https%3A%2F%2Fwww.foxnews.com%2Flifestyle%2Fnyc-women-punched-face-streets-tiktok-alarm-frightening-assaults.json",
        "image_url": "https://static.foxnews.com/foxnews.com/content/uploads/2024/03/nyc-halley-kate.png",
        "language": "en",
        "localpath": null,
        "maintext": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\nSeveral women have come forward on social media recently claiming they've been punched in the face or the head by strangers while walking in New York City.\nWithin the last 10 days, several young, female victims have posted on TikTok about the terrifying moments when they were approached by strangers and hit.\nTikTok user Olivia Brand, for example, uploaded a video on March 17 after she was \"punched by some man on the sidewalk.\"\nTIKTOK TREND HAS AIRLINE PASSENGERS BINDING THEIR ANKLES FOR EXTRA COMFORT: ‘INCREDIBLY DANGEROUS’\n\"He goes, ‘Sorry!’ And then punches me in the head,\" she recalled.\n\"Holy f---! What the hell just happened?\" she wrote.\nSocial media influencer Halley Kate, who has 1.1 million TikTok followers, posted a video of herself in a hysterical state after she experienced a similar hit to the head.\n\"I was literally just walking, and a man came up and punched me in the face,\" she said through tears.\nThe TikToker (@halleykate) showed off a golf-ball sized bump on the right side of her head near her hairline.\n\"I fell to the ground and now this giant goose egg is forming.\"\n\"It hurts so bad, I can’t even talk,\" she said.\n\"I fell to the ground and now this giant goose egg is forming.\"\nThe video currently has more than three million likes and 30 million views.\nShe followed up with multiple updates on the app, going into more detail in other videos.\nAt the time of the assault, Kate said she had been looking down at her phone when she was either \"punched or elbowed\" by a man, who was also walking a dog.\n\"I think he was just really mad that my head was down,\" she said. \"So, he took it upon himself to body-check me and let me know to be conscious of my surroundings.\"\nAfter she fell to the ground, she said she \"blacked out for a second\" and regained consciousness to find the man standing over her and \"screaming\" at her.\nPASSENGER'S RECLINED PLANE SEAT SEEN IN TIKTOK VIDEO REAWAKENS DEBATE: 'BANE OF MY EXISTENCE'\nThe content creator said she fled the scene out of fear — later visiting an urgent care facility to get her injuries assessed.\n\"The doctor told me that I seem[ed] OK, just to watch out for signs of vomiting or vision loss,\" she said. \"I think I’m completely fine.\"\nShe also said that she'd spoken with the New York Police Department (NYPD) and they are \"looking into it.\"\nAnother NYC woman, Mikayla Toninato, posted a video to TikTok shortly afterward, claiming that she was also \"punched in the face\" when leaving class.\nThe Parsons School of Design student shared that she \"turned the corner\" while looking down at her phone texting — and was met by a man who decided to hit her.\n\"I’m like actually in shock right now,\" she said, with a noticeable bruise forming underneath her left eye.\nDOES THE ‘SLEEPY GIRL MOCKTAIL’ REALLY WORK? EXPERT WEIGHS IN ON THE VIRAL SLEEP TREND\n\"I don’t know if this is like a thing that’s going around, but I guess if you’re in New York right now and you’re walking while looking at your phone, maybe don’t do that.\"\nShe added, \"I guess we’re going to be super aware of our surroundings.\"\nToninato posted an update in a follow-up video, detailing that she \"didn’t see him coming.\"\n\"My head was just clocked back, turned around, and I saw him looking at me walking away,\" she said.\n\"So many girls have reached out to me saying that this exact same story happened to them.\"\nToninato assumed that there are \"multiple men going around doing this,\" noting that the man who hit her was a \"Black male definitely over six feet tall.\"\n\"They see stuff like this happen every single day.\"\n\"He had dreads that, like, didn’t quite go to his shoulder,\" she described in her video.\nAccording to the police officer who assisted Toninato after the attack, there is a \"meth rehabilitation center\" located next to her school building in Union Square.\n\"They see stuff like this happen every single day because of the people that are just hanging out around the rehab center,\" she said.\nAfter a visit to the emergency room on March 26, Toninato was told she had a concussion.\n\"We officially have a concussion, a black eye and a chipped tooth,\" she said.\nThe women’s videos have gone viral on the app, with many users showing concern for safety in NYC’s streets.\nPolice reports filed\nThe NYPD confirmed to Fox News Digital that there had been at least two reports filed of this nature.\nOne report on file for harassment occurred on Sunday, March 17, when a 25-year-old female was walking her dog in the vicinity of Kenmare Street and Mulberry Street when she was punched in the head by a stranger.\nNo injuries were reported as a result, according to the police.\nOn Monday, March 25, another report was filed by a 23-year-old woman for assault while walking in the vicinity of West 16th Street and 7th Avenue.\nThe woman claimed in the report that an unknown individual hit her in the head, and she fell to the ground.\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\nShe suffered injuries to the left side of her face, according to the report, and was treated at a local medical facility.\nA spokesperson for the Deputy Commissioner for Public Information (DCPI) on Wednesday told Fox News Digital that there has been one arrest in the March 25 case, that the individual arrested has been charged with assault — and that the investigation \"remains ongoing.\"\nReferring to both cases, \"it is unclear if these incidents are connected at this time,\" a spokesperson also said.\nEncouraging awareness\nThe women who experienced these incidents of assault urged other women to stay safe and stay aware.\nHalley Kate, who’s lived in NYC for six years, shared in one of her videos that she believes these incidents were isolated cases, and that assaults of this kind are \"a somewhat common thing that happens in big cities.\"\nCLICK HERE TO GET THE FOX NEWS APP\n\"While it’s obviously really upsetting and disgusting that women have to deal with s--- like this, I personally am not going to revolve my life around that one incident,\" she said.\n\"I do think this is a good wake-up call just to be a little more aware of my surroundings – and that’s not just in New York City, literally anywhere in the world.\"\nShe added, \"Ladies, we’re not going to live our life in fear, but we are going to be cautious. We are going to be aware.\"\nFox News Digital reached out to all of the women mentioned above from TikTok for further comment and updates.",
        "source_domain": "www.foxnews.com",
        "text": null,
        "title": "NYC women are punched in the face on streets: TikTok sounds alarm about frightening assaults",
        "title_page": null,
        "title_rss": null,
        "url": "https://www.foxnews.com/lifestyle/nyc-women-punched-face-streets-tiktok-alarm-frightening-assaults"
    },
    "https://www.foxnews.com/us/bodycam-captures-suspect-clinging-to-moving-car-trying-to-evade-arrest": {
        "authors": [
            "Pilar Arias"
        ],
        "date_download": "2024-03-28 00:18:56",
        "date_modify": "None",
        "date_publish": "2024-03-27 11:41:08",
        "description": "Video shows a California man trying to flee from officers held onto a moving car after a car chase before officers caught up to him and shot him.",
        "filename": "https%3A%2F%2Fwww.foxnews.com%2Fus%2Fbodycam-captures-suspect-clinging-to-moving-car-trying-to-evade-arrest.json",
        "image_url": "https://static.foxnews.com/foxnews.com/content/uploads/2024/03/suspect-clings-to-car.jpg",
        "language": "en",
        "localpath": null,
        "maintext": "Join Fox News for access to this content Plus special access to select articles and other premium content with your account - free of charge. Please enter a valid email address.\nPolice in California released video of a pursuit that ended with a suspect clinging onto a moving car in what looked like a carjacking attempt, prior to being shot.\nVideo released Saturday by the Lathrop Police Department shows the Jan. 27 pursuit of suspect Juan Valdez, 40, after a woman called 911 to report her friend was being threatened by him.\nThe footage shows officers responding to the 200 block of Shadywood Avenue, where they encountered two distraught females arguing with a man they called \"John.\"\n\"He will fight back. Be careful,\" one woman could be heard saying as police tried to talk to the suspect.\nROMANIAN MOB IS COMING FOR YOUR DEBIT CARDS, WITH ATM-STYLE SKIMMERS NOW AT SELF-CHECKOUTS: AUTHORITIES WARN\nA gold Nissan Versa can then be seen backing out of a driveway, and officers begin pursuing it through the neighborhood.\nThe suspect returned to the home officers were initially called to, when one of the alleged victims said, \"You tried to kill me, John.\" An officer had a weapon pointed at the suspect, and another demanded he turn off the car. The suspect then took off in his vehicle.\nLA BURGLARS TUNNELED THROUGH BUSINESSES TO REACH JEWELRY STORE: 'MUST HAVE TAKEN A LOT OF WORK'\nWhat followed was a wild pursuit in which Valdez could be seen crossing into the wrong way of traffic prior to one of the officers unsuccessfully attempting to stop him. The chase picked up as the suspect entered Interstate 5. Soon after, one of the Versa's tires came apart.\nValdez could be seen hopping out of the car and grabbing onto the door of another car, hanging onto it as the driver kept going.\n\"He's trying to carjack somebody,\" one officer could be heard saying.\nThe other driver eventually pulled over as police caught up with them, and Valdez could be seen trying to run away.\nPolice warned the suspect to stop or be shot, before an officer fired twice and Valdez fell to the ground.\n\"Ah, bro, why'd you shoot me?\" he asked.\nValdez then identified himself to officers who provided first aid while waiting for emergency medical services to arrive.\nCLICK HERE TO GET THE FOX NEWS APP\nValdez was sent to a hospital, where he was later released before being booked into the San Joaquin County Jail. He was charged with multiple felonies, including carjacking, false imprisonment, evasion, resisting arrest and committing a felony while out on release/parole for a prior felony.\nOnline booking records show bail was not allowed in his case, and he is expected back in court on April 10.",
        "source_domain": "www.foxnews.com",
        "text": null,
        "title": "Bodycam captures suspect clinging to moving car trying to evade arrest",
        "title_page": null,
        "title_rss": null,
        "url": "https://www.foxnews.com/us/bodycam-captures-suspect-clinging-to-moving-car-trying-to-evade-arrest"
    }
}